Tekla.Structures.CatalogInternal.dotcatPrinterItemEnumerator_t
Serialization structure for Printer Item Enumerator

Tekla.Structures.CatalogInternal.dotcatPrinterItemEnumerator_t.MorePrinterItemsLeft
DO NOT USE! For internal usage only!

Tekla.Structures.CatalogInternal.dotcatPrinterItemEnumerator_t.IndexToStart
DO NOT USE! For internal usage only!

Tekla.Structures.CatalogInternal.dotcatPrinterItemEnumerator_t.nPrinterItems
Number of the printer items in the enumerator.

Tekla.Structures.CatalogInternal.dotcatPrinterItemEnumerator_t.aPrinterItemNames
Printer names list.

Tekla.Structures.CatalogInternal.dotcatPrinterItemEnumerator_t.aPrinterItemDevices
Printer devices list.

Tekla.Structures.CatalogInternal.dotcatPrinterItemEnumerator_t.aPrinterItemExtensions
Printer extensions list.

Tekla.Structures.CatalogInternal.dotcatPrinterItemEnumerator_t.aPrinterItemWidths
Printer paper area width list.

Tekla.Structures.CatalogInternal.dotcatPrinterItemEnumerator_t.aPrinterItemHeights
Printer paper area heigth list.

Tekla.Structures.CatalogInternal.dotcatPrinterItemEnumerator_t.ClientId
DO NOT USE! For internal usage only!